In [12]:
import pandas as pd

suppliers = pd.read_csv \
            ('../Labs files/course-files/northwind-mongo-master/suppliers _del_1.csv',
            usecols=['SupplierID','CompanyName', 'City'])
products = pd.read_csv \
            ('../Labs files/course-files/northwind-mongo-master/products_del_1.csv',
            usecols=['ProductID','ProductName', 'SupplierID'])
suppliers.head()

   SupplierID                         CompanyName         City
0           1                      Exotic Liquids       London
1           2          New Orleans Cajun Delights  New Orleans
2           3           Grandma Kelly's Homestead    Ann Arbor
3           4                       Tokyo Traders        Tokyo
4           5  Cooperativa de Quesos 'Las Cabras'       Oviedo

In [15]:
prod_and_sup = products.merge(suppliers, on='SupplierID')

In [16]:
prod_and_sup.head()

,ProductID,ProductName,SupplierID,CompanyName,City
0,1,Chai,1,Exotic Liquids,London
1,2,Chang,1,Exotic Liquids,London
2,3,Aniseed Syrup,1,Exotic Liquids,London
3,4,Chef Anton's Cajun Seasoning,2,New Orleans Cajun Delights,New Orleans
4,5,Chef Anton's Gumbo Mix,2,New Orleans Cajun Delights,New Orleans

In [17]:
print(len(suppliers),len(products),len(prod_and_sup))

27 75 70

In [20]:
prod_and_sup_outer = products.merge(suppliers, on='SupplierID',how='outer', indicator=True)

In [21]:
print(len(prod_and_sup_outer))

76

In [22]:
prod_and_sup_outer.head()

,ProductID,ProductName,SupplierID,CompanyName,City,_merge
0,1.0,Chai,1,Exotic Liquids,London,both
1,2.0,Chang,1,Exotic Liquids,London,both
2,3.0,Aniseed Syrup,1,Exotic Liquids,London,both
3,4.0,Chef Anton's Cajun Seasoning,2,New Orleans Cajun Delights,New Orleans,both
4,5.0,Chef Anton's Gumbo Mix,2,New Orleans Cajun Delights,New Orleans,both

In [27]:
filter_left = prod_and_sup_outer['_merge'] == 'left_only'
filter_right = prod_and_sup_outer['_merge'] == 'right_only'

In [28]:
prod_and_sup_outer['_merge'].value_counts()

both          70
left_only      5
right_only     1
Name: _merge, dtype: int64

In [29]:
prod_and_sup_outer[filter_left]

    ProductID          ProductName  SupplierID CompanyName City     _merge
27       22.0  Gustaf's Knäckebröd           9         NaN  NaN  left_only
28       23.0             Tunnbröd           9         NaN  NaN  left_only
48       36.0          Inlagd Sill          17         NaN  NaN  left_only
49       37.0           Gravad lax          17         NaN  NaN  left_only
50       73.0           Röd Kaviar          17         NaN  NaN  left_only

In [30]:
prod_and_sup_outer[filter_right]

,ProductID,ProductName,SupplierID,CompanyName,City,_merge
75,NaN,NaN,27,Escargots Nouveaux,Montceau,right_only